/* BEGINREMOVEFROMADDON */
/* NOTE: All code contained between comments that look like
 *             BEGINREMOVEFROMADDON
 *             ENDREMOVEFROMADDON
 * are pulled out to create the GLOBAL.h file used in addons.
 */
/* ENDREMOVEFROMADDON */

/*
******************************************************************
******************************************************************
*******                                                   ********
******  (C) 1988-2010 Tecplot, Inc.                        *******
*******                                                   ********
******************************************************************
******************************************************************
*/

#ifndef _GLOBAL_H
#define _GLOBAL_H

#if defined EXTERN
#undef EXTERN
#endif
#if defined Q_MAINMODULE && defined TECPLOTKERNEL
/* CORE SOURCE CODE REMOVED */
#else
#define EXTERN extern
#endif

#define EXPORT_DEPRECATED_INTERFACES_TO_ADK_ONLY
/* BEGINREMOVEFROMADDON */
/*
 * The reason for wrapping this test with "begin and end remove from addon" key
 * words is so that the ADK users doesn't have to see this mess.
 */
#if !defined COREAPI && \
    !defined TECUTILMMODULE && \
    !defined TECUTILOMODULE && \
    !defined TECUTILQMODULE && \
    !defined TECUTILSMODULE
/* we don't want Tecplot internals using deprecated interfaces */
#  undef EXPORT_DEPRECATED_INTERFACES_TO_ADK_ONLY
#endif
/* ENDREMOVEFROMADDON */



#define COPY_AND_REVERSE_4_UNALIGNED_BYTES(DstBuffer, SrcBuffer) \
        do { \
          /* cannot check sizeof(SrcBuffer) or sizeof(DstBuffer) because they are */ \
          /* most likely single byte pointers into unaligned blocks of data */ \
          ((Byte_t *)(DstBuffer))[0] = ((Byte_t *)(SrcBuffer))[3]; \
          ((Byte_t *)(DstBuffer))[1] = ((Byte_t *)(SrcBuffer))[2]; \
          ((Byte_t *)(DstBuffer))[2] = ((Byte_t *)(SrcBuffer))[1]; \
          ((Byte_t *)(DstBuffer))[3] = ((Byte_t *)(SrcBuffer))[0]; \
        } while (FALSE)

/**
 * Copies four bytes from SrcBuffer to DstBuffer without causing a page
 * fault due to misaligned words.
 *
 * param DstBuffer
 *     Pointer the buffer to send the four bytes to
 * param SrcBuffer
 *     Pointer the buffer to get the four bytes from
 */
#define COPY_8_UNALIGNED_BYTES(DstBuffer, SrcBuffer) \
        do { \
          /* cannot check sizeof(SrcBuffer) or sizeof(DstBuffer) because they are */ \
          /* most likely single byte pointers into unaligned blocks of data */ \
          ((Byte_t *)(DstBuffer))[0] = ((Byte_t *)(SrcBuffer))[0]; \
          ((Byte_t *)(DstBuffer))[1] = ((Byte_t *)(SrcBuffer))[1]; \
          ((Byte_t *)(DstBuffer))[2] = ((Byte_t *)(SrcBuffer))[2]; \
          ((Byte_t *)(DstBuffer))[3] = ((Byte_t *)(SrcBuffer))[3]; \
          ((Byte_t *)(DstBuffer))[4] = ((Byte_t *)(SrcBuffer))[4]; \
          ((Byte_t *)(DstBuffer))[5] = ((Byte_t *)(SrcBuffer))[5]; \
          ((Byte_t *)(DstBuffer))[6] = ((Byte_t *)(SrcBuffer))[6]; \
          ((Byte_t *)(DstBuffer))[7] = ((Byte_t *)(SrcBuffer))[7]; \
        } while (FALSE)

/**
 * Copies eight bytes from SrcBuffer to DstBuffer swapping the bytes
 * as it copies.  Will not cause a page fault due to misaligned words.
 *
 * param DstBuffer
 *     Pointer the buffer to send the four bytes to
 * param SrcBuffer
 *     Pointer the buffer to get the four bytes from
 */
#define COPY_AND_REVERSE_8_UNALIGNED_BYTES(DstBuffer, SrcBuffer) \
        do { \
          /* cannot check sizeof(SrcBuffer) or sizeof(DstBuffer) because they are */ \
          /* most likely single byte pointers into unaligned blocks of data */ \
          ((Byte_t *)(DstBuffer))[0] = ((Byte_t *)(SrcBuffer))[7]; \
          ((Byte_t *)(DstBuffer))[1] = ((Byte_t *)(SrcBuffer))[6]; \
          ((Byte_t *)(DstBuffer))[2] = ((Byte_t *)(SrcBuffer))[5]; \
          ((Byte_t *)(DstBuffer))[3] = ((Byte_t *)(SrcBuffer))[4]; \
          ((Byte_t *)(DstBuffer))[4] = ((Byte_t *)(SrcBuffer))[3]; \
          ((Byte_t *)(DstBuffer))[5] = ((Byte_t *)(SrcBuffer))[2]; \
          ((Byte_t *)(DstBuffer))[6] = ((Byte_t *)(SrcBuffer))[1]; \
          ((Byte_t *)(DstBuffer))[7] = ((Byte_t *)(SrcBuffer))[0]; \
        } while (FALSE)

/**
 * Reverses the byte order of the specified 2 byte buffer.
 *
 * param Buffer
 *     Pointer to the 2 bytes needing byte order reversal.
 */
#define REVERSE_2_BYTES_1_AT_A_TIME(Buffer) \
          do { \
            Byte_t Byte0 = ((Byte_t *)(Buffer))[0]; \
            CHECK(sizeof(*(Buffer))==1 || sizeof(*(Buffer))==2); \
            ((Byte_t *)(Buffer))[0] = ((Byte_t *)(Buffer))[1]; \
            ((Byte_t *)(Buffer))[1] = Byte0; \
          } while (FALSE)

#define REVERSE_2_BYTES_2_AT_A_TIME(Buffer) \
          do { \
            UInt16_t data_bits = ((UInt16_t *)(Buffer))[0]; \
            CHECK(sizeof(*(Buffer))==1 || sizeof(*(Buffer))==2); \
            ((UInt16_t *)(Buffer))[0] = (((data_bits)<<8) | \
                                         ((data_bits&0xff))); \
          } while (FALSE)

/* REVERSE_2_BYTES_2_AT_A_TIME may actually be slower, needs testing. */
#define REVERSE_2_BYTES REVERSE_2_BYTES_1_AT_A_TIME

/**
 * Reverses the byte order of the specified 4 byte buffer.
 *
 * param Buffer
 *     Pointer to the 4 bytes needing byte order reversal.
 *
 * How this works:
 *
 *   ABCD
 *   D--- <<24  (1)
 *
 *   ABCD
 *   --C- &0x0000ff00
 *   -C-- <<8   (2)
 *
 *   ABCD
 *   -B-- &0x00ff0000
 *   --B- >>8   (3)
 *
 *   ABCD
 *   ---A >>24  (4)
 *
 * (1) | (2) | (3) | (4) = DCBA.
 *
 */
#define REVERSE_4_BYTES_1_AT_A_TIME(Buffer) \
          do { \
            Byte_t Byte0 = ((Byte_t *)(Buffer))[0]; \
            Byte_t Byte1 = ((Byte_t *)(Buffer))[1]; \
            CHECK(sizeof(*(Buffer))==1 || sizeof(*(Buffer))==4); \
            ((Byte_t *)(Buffer))[0] = ((Byte_t *)(Buffer))[3]; \
            ((Byte_t *)(Buffer))[1] = ((Byte_t *)(Buffer))[2]; \
            ((Byte_t *)(Buffer))[2] = Byte1; \
            ((Byte_t *)(Buffer))[3] = Byte0; \
          } while (FALSE)

#define REVERSE_4_BYTES_4_AT_A_TIME(Buffer) \
          do { \
            UInt32_t data_bits = *((UInt32_t *)(Buffer)); \
            CHECK(sizeof(*(Buffer))==1 || sizeof(*(Buffer))==4); \
            *((UInt32_t *)(Buffer)) = (((data_bits)<<24)            | \
                                       ((data_bits&0x0000ff00)<<8)  | \
                                       ((data_bits&0x00ff0000)>>8)  | \
                                       ((data_bits)>>24)); \
          } while (FALSE)

#if defined MSWIN
/*
 * The DevStuido compiler seems to be the only one that can truly handle this
 * when optimization is turned on.
 */
#define REVERSE_4_BYTES REVERSE_4_BYTES_4_AT_A_TIME
#else
#define REVERSE_4_BYTES REVERSE_4_BYTES_1_AT_A_TIME
#endif

/**
 * Reverses the byte order of the specified 8 byte buffer.
 *
 * param Buffer
 *     Pointer to the 8 bytes needing byte order reversal.
 */
#define REVERSE_8_BYTES_1_AT_A_TIME(Buffer) \
        do { \
            Byte_t Byte0 = ((Byte_t *)(Buffer))[0]; \
            Byte_t Byte1 = ((Byte_t *)(Buffer))[1]; \
            Byte_t Byte2 = ((Byte_t *)(Buffer))[2]; \
            Byte_t Byte3 = ((Byte_t *)(Buffer))[3]; \
            CHECK(sizeof(*(Buffer))==1 || sizeof(*(Buffer))==8); \
            ((Byte_t *)(Buffer))[0] = ((Byte_t *)(Buffer))[7]; \
            ((Byte_t *)(Buffer))[1] = ((Byte_t *)(Buffer))[6]; \
            ((Byte_t *)(Buffer))[2] = ((Byte_t *)(Buffer))[5]; \
            ((Byte_t *)(Buffer))[3] = ((Byte_t *)(Buffer))[4]; \
            ((Byte_t *)(Buffer))[4] = Byte3; \
            ((Byte_t *)(Buffer))[5] = Byte2; \
            ((Byte_t *)(Buffer))[6] = Byte1; \
            ((Byte_t *)(Buffer))[7] = Byte0; \
        } while (FALSE)

#define REVERSE_8_BYTES_2_AT_A_TIME(Buffer) \
        do { \
          UInt16_t data_bits_0 = ((UInt16_t *)(Buffer))[0]; \
          UInt16_t data_bits_1 = ((UInt16_t *)(Buffer))[1]; \
          UInt16_t data_bits_2 = ((UInt16_t *)(Buffer))[2]; \
          UInt16_t data_bits_3 = ((UInt16_t *)(Buffer))[3]; \
          CHECK(sizeof(*(Buffer))==1 || sizeof(*(Buffer))==8); \
          ((UInt16_t *)(Buffer))[0] = (((data_bits_3)<<8) | \
                                       ((data_bits_3&0xff))); \
          ((UInt16_t *)(Buffer))[1] = (((data_bits_2)<<8) | \
                                       ((data_bits_2&0xff))); \
          ((UInt16_t *)(Buffer))[2] = (((data_bits_1)<<8) | \
                                       ((data_bits_1&0xff))); \
          ((UInt16_t *)(Buffer))[3] = (((data_bits_0)<<8) | \
                                       ((data_bits_0&0xff))); \
        } while (FALSE)

#define REVERSE_8_BYTES_4_AT_A_TIME(Buffer) \
        do { \
          UInt32_t data_bits_0 = ((UInt32_t *)(Buffer))[0]; \
          UInt32_t data_bits_1 = ((UInt32_t *)(Buffer))[1]; \
          CHECK(sizeof(*(Buffer))==1 || sizeof(*(Buffer))==8); \
          ((UInt32_t *)(Buffer))[0] = (((data_bits_1)<<24)           | \
                                       ((data_bits_1&0x0000ff00)<<8) | \
                                       ((data_bits_1&0x00ff0000)>>8) | \
                                       ((data_bits_1)>>24)); \
          ((UInt32_t *)(Buffer))[1] = (((data_bits_0)<<24)           | \
                                       ((data_bits_0&0x0000ff00)<<8) | \
                                       ((data_bits_0&0x00ff0000)>>8) | \
                                       ((data_bits_0)>>24)); \
        } while (FALSE)

#define REVERSE_8_BYTES_8_AT_A_TIME(Buffer) \
        do { \
          UInt64_t data_bits = *((UInt64_t *)(Buffer)); \
          CHECK(sizeof(*(Buffer))==1 || sizeof(*(Buffer))==8); \
          *((UInt64_t *)(Buffer)) = (((data_bits)<<56) | \
                                     ((data_bits&0x000000000000ff00)<<40) | \
                                     ((data_bits&0x0000000000ff0000)<<24) | \
                                     ((data_bits&0x00000000ff000000)<<8)  | \
                                     ((data_bits&0x000000ff00000000)>>8)  | \
                                     ((data_bits&0x0000ff0000000000)>>24) | \
                                     ((data_bits&0x00ff000000000000)>>40) | \
                                     ((data_bits)>>56)); \
        } while (FALSE)


#if defined MSWIN
/*
 * The DevStuido compiler seems to be the only one that can truly handle this
 * when optimization is turned on.
 */
#define REVERSE_8_BYTES REVERSE_8_BYTES_4_AT_A_TIME
#else
#define REVERSE_8_BYTES REVERSE_8_BYTES_1_AT_A_TIME
#endif


/****************************************************************
